## Read Data From Database

In [1]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='1234', host='localhost', database='weather', auth_plugin='mysql_native_password')
cursor = cnx.cursor()

cursor.execute('''SELECT * FROM users;''')

In [2]:
rows = cursor.fetchall()

In [3]:
for uid,name,city,age  in rows:
    print(f'user with id {uid} has name {name} lives in {city} and his age = {age}')

user with id 3 has name eman lives in Giza and his age = 20
user with id 12 has name Eslam Ahmed lives in Cairo and his age = 20
user with id 15 has name hamada lives in Cairo and his age = 22
user with id 19 has name Medhat lives in Maadi and his age = 22
user with id 22 has name Menna lives in Cairo and his age = 22
user with id 23 has name Ezz lives in Giza and his age = 22
user with id 25 has name Menna lives in Cairo and his age = 22
user with id 27 has name Ahmed lives in Giza and his age = 25

## Use Pandas to execute sql

In [11]:
import pandas as pd
df = pd.read_sql("SELECT * from users", cnx)
cnx.close()
df.head()

   id        name1   city  age
0   0        Ahmed   Giza   25
1   3         eman   Giza   20
2  12  Eslam Ahmed  Cairo   20
3  15       hamada  Cairo   22
4  19       Medhat  Maadi   22

import mysql.connector

cnx = mysql.connector.connect(user='root', password='0000', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute(f"SELECT * FROM weather.users WHERE city = {city_input} ; ")
rows = cursor.fetchall()

for uid,name,city,age  in rows:
    print(f'user with id {uid} has name {name} lives in {city} and his age = {age}')

## Insert Data into Database

In [5]:
city_input = input("enter city name")
cnx = mysql.connector.connect(user='root', password='1234', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute(f"SELECT * FROM weather.users WHERE city = '{city_input}' ; ")
rows = cursor.fetchall()
for uid,name,city,age  in rows:
    print(f'user with id {uid} has name {name} lives in {city} and his age = {age}')

enter city nameCairo
user with id 12 has name Eslam Ahmed lives in Cairo and his age = 20
user with id 15 has name hamada lives in Cairo and his age = 22
user with id 22 has name Menna lives in Cairo and his age = 22
user with id 25 has name Menna lives in Cairo and his age = 22

In [6]:
connection = mysql.connector.connect(user='root', password='1234', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute("""INSERT INTO users (id, name1,city,age) VALUES (%s,%s, %s, %s)""" , (312,'Ebrahem', 'Giza', '35'))
connection.commit()
connection.close()

In [7]:
connection = mysql.connector.connect(user='root', password='1234', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute("INSERT INTO users (id,name1,city,age) VALUES (%s, %s, %s,%s)", [0,'Ahmed', 'Giza', '25'])
connection.commit()
connection.close()

In [8]:
name = input('Enter user name: ')
city = input('Enter user city: ')
age = input('Enter user age: ')

connection = mysql.connector.connect(user='root', password='1234', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute("INSERT INTO users (id,name1,city,age) VALUES (%s, %s, %s,%s)", [23432,name, city, age])
connection.commit()
connection.close()

Enter user name: Muhab
Enter user city: Cairo
Enter user age: 27

## Update Data in Database

In [9]:
connection = mysql.connector.connect(user='root', password='1234', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute("UPDATE users SET name1=%s, age=%s WHERE id=%s ", ['Ezz', 22, 31])
connection.commit()
connection.close()

## Delete Data in Database

In [10]:
connection = mysql.connector.connect(user='root', password='1234', host='127.0.0.1',database='weather')
cursor = cnx.cursor()
cursor.execute("DELETE FROM users WHERE age >= %s ", [30])
connection.commit()
connection.close()